Repository: kgabriel-dev/WeatherMap
Catalog: src/locale/messages.*.xlf
Languages: de

source: Weather Data
de: Wetterdaten

source: Custom temporary location - you can create permanent locations in the settings
de: Benutzerdef. temporärer Ort - Permanente Orte können in den Einstellungen erzeugt werden

source: Custom Location
de: Benutzerdef. Ort

source: Location: location
de: Ort: location

source: Region size: sessionData.mainData.regionSize.lengthxsessionData.mainData.regionSize.length SizeUnitStrings[sessionData.mainData.regionSize.unitId].display
de: Regionsgröße: sessionData.mainData.regionSize.lengthxsessionData.mainData.regionSize.length sessionData.mainData.regionSize.unit

source: Resolution: sessionData.mainData.regionResolutionxsessionData.mainData.regionResolution
de: Auflösung: sessionData.mainData.regionResolutionxsessionData.mainData.regionResolution

source: Weather data: sessionData.mainData.weatherCondition?.condition ?? '** Unknown **'
de: Wetterdaten: sessionData.mainData.weatherCondition?.condition ?? '** Unknown **'

source: Time: new Date(imageDate).toLocaleString(Intl.getCanonicalLocales(this.settingsService.getSettings().languageCode), { dateStyle: 'medium', timeStyle: 'short' })
de: Zeit: new Date(imageDate).toLocaleString(undefined, { dateStyle: 'medium', timeStyle: 'short' })

source: hours
de: Stunden

source: days
de: Tage

source: Location:
de: Ort:

source: Latitude:
de: Breitengrad:

source: Longitude:
de: Längengrad:

source: Size:
de: Größe:

source: Resolution (n ✕ n steps):
de: Auflösung (n ✕ n Schritte):

source: Forecast length:
de: Länge der Vorhersage:

source: Override location's timezone
de: Zeitzone des Ortes überschreiben

source: Source:
de: Quelle:

source: Condition:
de: Bedingung:

source: Click to center the map on the selected location.
de: Klicken, um die Karte auf den ausgewählten Ort zu zentrieren.

source: Generate Images
de: Bilder generieren

source: Cancel
de: Abbrechen

source: Select a location
de: Wähle eine Region

source: (makes 1 step)
de: (ergibt 1 Schritt)

source: (makes $number$ steps)
de: (ergibt $number$ Schritte)

source: Image generation canceled by user
de: Bildgenerierung vom Nutzer gestoppt

source: Learn more
de: Mehr erfahren

source: About
de: Über

source: Developer Tools
de: Entwicklertools

source: Open Settings
de: Einstellungen öffnen

source: Settings
de: Einstellungen

source: Window
de: Fenster

source: Help
de: Hilfe

source: Minimize
de: Minimieren

source: Close
de: Schließen

source: Deleting the old weather images
de: Lösche die alten Wetterbilder

source: Canceled by the user
de: Vorgang vom Nutzer abgebrochen

source: Data gathering finished. Converting the data now.
de: Datensammlung abgeschlossen. Konvertiere jetzt die Daten.

source: Starting creation of image $index$.
de: Starte Generierung von Bild $index$.

source: Finished creating the weather images.
de: Generierung der Wetterbilder abgeschlossen.

source: Unknown data gatherer: $dataGathererName$
de: Unbekannte Datenquelle: $dataGathererName$

source: Request for location #$index$ succeeded.
de: Abfrage für Position #$index$ erfolgreich.

source: Request for location #$index$ failed.
de: Abfrage für Position #$index$ fehlgeschlagen.

source: Temperature (°C)
de: Temperatur (°C)

source: Cloud Coverage (%)
de: Bewölkung (%)

source: Relative Humidity (%)
de: Relative Luftfeuchte (%)

source: Cloud Coverage Low (%)
de: Bewölkung niedrig (%)

source: Cloud Coverage Mid (%)
de: Bewölkung mittel (%)

source: Cloud Coverage High (%)
de: Bewölkung hoch (%)

source: Dew Point (°C)
de: Taupunkt (°C)

source: Air Pressure (hPa)
de: Luftdruck (hPa)

source: Precipitation (mm)
de: Niederschlag (mm)

source: Precipitation Probability (%)
de: Regenwahrscheinlichkeit (%)

source: Visibility (m)
de: Sichtweite (m)

source: Wind Speed (km/h)
de: Windgeschwindigkeit (km/h)

source: Yes
de: Ja

source: No
de: Nein

source: An update is available. Do you want to download it now?
de: Es ist ein Update verfügbar. Möchtest Du es jetzt downloaden?

source: Update available
de: Update verfügbar

source: Ok
de: Okay

source: No update available
de: Kein Update verfügbar

source: You are already using the latest version.
de: Du benutzt bereits die neueste Version.

source: Progress
de: Fortschritt

source: Step description
de: Beschreibung des Schrittes

source: Language:
de: Sprache:

source: Dark mode
de: Dunkler Modus

source: Default weather condition:
de: Standard-Wetterbedingung

source: Default length of forecast:
de: Standardlänge der Vorhersage:

source: Labeled weather images
de: Beschriftete Wetterbilder

source: Show labels on the weather images.
de: Zeige Label auf den Wetterbildern.

source: Location name:
de: Name der Region:

source: Timezone:
de: Zeitzone:

source: Region size:
de: Regionsgröße:

source: Resolution (results in n ✕ n steps):
de: Auflösung (ergibt n ✕ n Schritte):

source: No locations found. Add a location to get started.
de: Keine Regionen gefunden. Füge eine Region hinzu.

source: Update check & notification
de: Auf Updates prüfen & benachrichtigen

source: Check for updates at startup and notify me when an update is available.
de: Prüfe beim Start auf Updates und benachrichtige mich, wenn ein Update verfügbar ist.

source: Save & Close
de: Speichern & Schließen

source: Discard & Close
de: Verwerfen & Schließen

source: General
de: Allgemein

source: Locations
de: Regionen

source: Add Location
de: Neue Region

source: Save
de: Speichern

source: Delete
de: Löschen

source: Discard
de: Abbrechen

source: Check for Updates
de: Auf Updates prüfen

source: Loading locations...
de: Lade Positionen...

source: Please wait a moment.
de: Bitte warte einen Moment.

source: This is taking longer than expected. Please wait a moment.
de: Das dauert länger als erwartet. Bitte warte einen Moment.
